---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SurfaceName
source: html/39e4a21e-e897-20de-96f2-71156f9a469d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SurfaceName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SurfaceName { get; }
```